import os
import time
os.system("clear")
print("""\033[1;92m
  ███████╗██████╗       ██╗     ██╗██╗  ██╗███████╗
  ██╔════╝██╔══██╗      ██║     ██║██║ ██╔╝██╔════╝
  █████╗  ██████╦╝█████╗██║     ██║█████═╝ █████╗
  ██╔══╝  ██╔══██╗╚════╝██║     ██║██╔═██╗ ██╔══╝
  ██║     ██████╦╝      ███████╗██║██║ ╚██╗███████╗
  ╚═╝     ╚═════╝       ╚══════╝╚═╝╚═╝  ╚═╝╚══════╝
                                        [ FB : xปิยะวัฒน์ ทวีคำ ]
""")
print("")
u = input("\033[1;91m> \033[0mลิงก์โพสต์ : \033[1;96m")
c = input("\033[1;91m> \033[0mเลือกอิโมจิ (👍,💖,😡,😳) : \033[1;96m")
t = input("\033[1;91m> \033[0mเวลา : \033[1;96m")
NUM = int(input("\033[1;91m> \033[0mจำนวนไลค์ : \033[1;96m"))
print("")
print("[กำลังเพิ่มยอดไลค์]")

for i in range(NUM):
	time.sleep(3)
	print(f"\033[1;93m{i+1}. เพิ่มยอดไลค์สำเร็จ")